src/main/java/ok/dht/test/slastin/report/wrk2/puts-27500.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 7.251ms, rate sampling interval: 46ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.80ms    9.65ms  75.26ms   90.24%
    Req/Sec    27.82k     2.16k   37.19k    77.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91ms
 75.000%    4.43ms
 90.000%   14.23ms
 99.000%   54.05ms
 99.900%   71.55ms
 99.990%   75.01ms
 99.999%   75.33ms
100.000%   75.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000           12         1.00
       0.214     0.100000        96724         1.11
       0.391     0.200000       192489         1.25
       0.567     0.300000       289046         1.43
       0.741     0.400000       385152         1.67
       0.914     0.500000       481197         2.00
       0.999     0.550000       529794         2.22
       1.082     0.600000       577662         2.50
       1.629     0.650000       625543         2.86
       2.799     0.700000       673650         3.33
       4.431     0.750000       721855         4.00
       5.447     0.775000       745826         4.44
       6.647     0.800000       769896         5.00
       7.847     0.825000       793989         5.71
       9.551     0.850000       818076         6.67
      11.623     0.875000       842099         8.00
      12.887     0.887500       854120         8.89
      14.231     0.900000       866185        10.00
      15.527     0.912500       878191        11.43
      17.455     0.925000       890184        13.33
      20.015     0.937500       902225        16.00
      21.343     0.943750       908281        17.78
      23.215     0.950000       914274        20.00
      25.375     0.956250       920259        22.86
      28.255     0.962500       926266        26.67
      31.167     0.968750       932280        32.00
      32.623     0.971875       935284        35.56
      33.695     0.975000       938317        40.00
      35.231     0.978125       941310        45.71
      37.215     0.981250       944307        53.33
      45.087     0.984375       947305        64.00
      49.247     0.985938       948810        71.11
      51.423     0.987500       950322        80.00
      52.799     0.989062       951814        91.43
      57.119     0.990625       953355       106.67
      59.903     0.992188       954844       128.00
      60.223     0.992969       955630       142.22
      60.383     0.993750       956401       160.00
      60.511     0.994531       957211       182.86
      60.799     0.995313       957831       213.33
      61.759     0.996094       958584       256.00
      62.143     0.996484       958972       284.44
      62.367     0.996875       959335       320.00
      63.231     0.997266       959711       365.71
      64.671     0.997656       960085       426.67
      65.983     0.998047       960480       512.00
      66.623     0.998242       960652       568.89
      68.095     0.998437       960836       640.00
      69.695     0.998633       961043       731.43
      70.463     0.998828       961214       853.33
      71.743     0.999023       961406      1024.00
      72.383     0.999121       961524      1137.78
      72.831     0.999219       961588      1280.00
      73.343     0.999316       961686      1462.86
      73.599     0.999414       961778      1706.67
      73.983     0.999512       961880      2048.00
      74.047     0.999561       961919      2275.56
      74.175     0.999609       962023      2560.00
      74.175     0.999658       962023      2925.71
      74.303     0.999707       962081      3413.33
      74.431     0.999756       962112      4096.00
      74.559     0.999780       962140      4551.11
      74.623     0.999805       962162      5120.00
      74.687     0.999829       962178      5851.43
      74.879     0.999854       962199      6826.67
      75.007     0.999878       962244      8192.00
      75.007     0.999890       962244      9102.22
      75.071     0.999902       962273     10240.00
      75.071     0.999915       962273     11702.86
      75.071     0.999927       962273     13653.33
      75.135     0.999939       962297     16384.00
      75.135     0.999945       962297     18204.44
      75.135     0.999951       962297     20480.00
      75.199     0.999957       962313     23405.71
      75.199     0.999963       962313     27306.67
      75.199     0.999969       962313     32768.00
      75.199     0.999973       962313     36408.89
      75.263     0.999976       962328     40960.00
      75.263     0.999979       962328     46811.43
      75.263     0.999982       962328     54613.33
      75.263     0.999985       962328     65536.00
      75.263     0.999986       962328     72817.78
      75.263     0.999988       962328     81920.00
      75.327     0.999989       962339     93622.86
      75.327     1.000000       962339          inf
#[Mean    =        4.803, StdDeviation   =        9.647]
#[Max     =       75.264, Total count    =       962339]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1237456 requests in 45.00s, 79.07MB read
Requests/sec:  27499.40
Transfer/sec:      1.76MB