src/main/java/ok/dht/test/slastin/report/wrk2/puts-30000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 3.355ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.22ms   14.20ms  64.99ms   84.05%
    Req/Sec    30.69k     3.17k   39.13k    71.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%   12.23ms
 90.000%   32.14ms
 99.000%   58.56ms
 99.900%   63.62ms
 99.990%   64.96ms
 99.999%   65.02ms
100.000%   65.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000           13         1.00
       0.264     0.100000       105377         1.11
       0.487     0.200000       210538         1.25
       0.703     0.300000       315407         1.43
       0.910     0.400000       420198         1.67
       1.186     0.500000       525268         2.00
       1.947     0.550000       577781         2.22
       3.369     0.600000       630304         2.50
       5.551     0.650000       682842         2.86
       8.407     0.700000       735405         3.33
      12.231     0.750000       787918         4.00
      14.927     0.775000       814150         4.44
      17.551     0.800000       840542         5.00
      20.959     0.825000       866633         5.71
      25.439     0.850000       892895         6.67
      28.687     0.875000       919228         8.00
      30.239     0.887500       932410         8.89
      32.143     0.900000       945467        10.00
      34.079     0.912500       958698        11.43
      35.967     0.925000       971714        13.33
      38.815     0.937500       984862        16.00
      40.511     0.943750       991469        17.78
      42.015     0.950000       998031        20.00
      43.647     0.956250      1004518        22.86
      45.791     0.962500      1011100        26.67
      48.671     0.968750      1017698        32.00
      49.759     0.971875      1020991        35.56
      50.783     0.975000      1024201        40.00
      51.967     0.978125      1027603        45.71
      53.215     0.981250      1030832        53.33
      54.847     0.984375      1034087        64.00
      55.807     0.985938      1035701        71.11
      56.543     0.987500      1037366        80.00
      57.567     0.989062      1038990        91.43
      59.423     0.990625      1040628       106.67
      60.223     0.992188      1042303       128.00
      60.575     0.992969      1043133       142.22
      60.799     0.993750      1043947       160.00
      61.183     0.994531      1044761       182.86
      61.663     0.995313      1045580       213.33
      62.079     0.996094      1046394       256.00
      62.303     0.996484      1046827       284.44
      62.463     0.996875      1047237       320.00
      62.623     0.997266      1047646       365.71
      62.783     0.997656      1048055       426.67
      62.975     0.998047      1048490       512.00
      63.039     0.998242      1048684       568.89
      63.135     0.998437      1048855       640.00
      63.263     0.998633      1049081       731.43
      63.391     0.998828      1049283       853.33
      63.647     0.999023      1049443      1024.00
      63.775     0.999121      1049554      1137.78
      63.935     0.999219      1049647      1280.00
      64.127     0.999316      1049756      1462.86
      64.287     0.999414      1049869      1706.67
      64.415     0.999512      1049955      2048.00
      64.479     0.999561      1050005      2275.56
      64.543     0.999609      1050081      2560.00
      64.575     0.999658      1050108      2925.71
      64.639     0.999707      1050174      3413.33
      64.703     0.999756      1050208      4096.00
      64.767     0.999780      1050268      4551.11
      64.767     0.999805      1050268      5120.00
      64.799     0.999829      1050293      5851.43
      64.831     0.999854      1050309      6826.67
      64.895     0.999878      1050340      8192.00
      64.927     0.999890      1050354      9102.22
      64.959     0.999902      1050399     10240.00
      64.959     0.999915      1050399     11702.86
      64.959     0.999927      1050399     13653.33
      64.959     0.999939      1050399     16384.00
      64.991     0.999945      1050438     18204.44
      64.991     0.999951      1050438     20480.00
      64.991     0.999957      1050438     23405.71
      64.991     0.999963      1050438     27306.67
      64.991     0.999969      1050438     32768.00
      64.991     0.999973      1050438     36408.89
      64.991     0.999976      1050438     40960.00
      65.023     0.999979      1050462     46811.43
      65.023     1.000000      1050462          inf
#[Mean    =        9.216, StdDeviation   =       14.203]
#[Max     =       64.992, Total count    =      1050462]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1349960 requests in 45.00s, 86.26MB read
Requests/sec:  29999.39
Transfer/sec:      1.92MB